#include "header.h"																	//хэдер с прототипами функций и необходимыми библиотеками

int input_nat()																		//функция ввода натурального числа
{
	int n = 0;																		//размерность массива
	int k = 0;																		//вспомогательная переменная для проверки на ввод целого числа

	do																				//ввод размерности массива с проверкой на целое число
	{	
		rewind(stdin);																//очистка буфера
		k = scanf_s("%d", &n);

	} while (!k || n <= 0);															//если введено не целое число, цикл повторяется

	return n;
}

shape* allocate_memory(int n)														//функция выделения памяти для массива структур (кубов)
{
	int i = 0;
	shape* array;																	//массив кубов

	array = (shape*)calloc(n, sizeof(shape));
	if (!array)																		//если память не была выделена
	{
		printf("Память не была выделена!");
		return 0;
	}

	return array;																	//возврат массива структур
}

void input_array(shape* array, int n)												//функция заполнения полей массива фигур
{
	int i = 0;

	for (i = 0; i < n; i++)
	{
		printf("\nВведите тип %d-й фигуры (1 — треугольник, 2 — трапеция, 3 — окружность): ", i+1);
		(array + i)->name = input_nat();										

		switch ((array + i)->name)
		{
			case 1:																	//если треугольник
				printf("Введите длину основания треугольника: ");
				(array + i)->t.tri.b = input_nat();
				printf("Введите длину высоты треугольника: ");
				(array + i)->t.tri.h = input_nat();
				break;

			case 2:																	//если трапеция
				printf("Введите длину 1-ого основания трапеции: ");
				(array + i)->t.tra.b1 = input_nat();
				printf("Введите длину 2-ого основания трапеции: ");
				(array + i)->t.tra.b2 = input_nat();
				printf("Введите длину высоты трапеции: ");
				(array + i)->t.tra.h = input_nat();
				break;

			case 3:																	//если окружность
				printf("Введите длину радиуса окружности: ");
				(array + i)->t.cir.r = input_nat();
				break;
		}
	}
}

void print_array(shape* array, int n)												//функция вывода входных значений
{
	int i = 0;

	puts("\n======================================================");				//оформление в виде таблицы
	puts("======================================================\n");

	printf("Тип фигуры: | Измерения: \n\n");

	for (i = 0; i < n; i++)															//вывод информации об i-ой фигуре
		switch ((array + i)->name)
		{
			case 1:																	//если треугольник
				printf("Треугольник | Основание: %d, высота: %d\n", (array + i)->t.tri.b, (array + i)->t.tri.h);
				break;

			case 2:																	//если трапеция
				printf("Трапеция    | Основание 1: %d, основание 2: %d, высота: %d\n", (array + i)->t.tra.b1, (array + i)->t.tra.b2, (array + i)->t.tra.h);
				break;

			case 3:																	//если окружность
				printf("Окружность  | Радиус: %d\n", (array + i)->t.cir.r);
				break;
		}

	puts("\n======================================================");
	puts("======================================================\n");
}

shape area(shape sh)																//функция нахождения площади
{
	switch (sh.name)
	{
		case 1:																		//если треугольник
			sh.s = sh.t.tri.b * sh.t.tri.h / 2;										//расчёт площади треугольника по формуле b*h/2
			break;

		case 2:																		//если трапеция
			sh.s = (sh.t.tra.b1 + sh.t.tra.b2) / 2 * sh.t.tra.h;					//расчёт площади трапеции по формуле (b1+b2)/2*h
			break;

		case 3:																		//если окружность
			sh.s = sh.t.cir.r * sh.t.cir.r * 3.14;									//расчёт площади окружности по формуле PI*r^2
			break;
	}

	return sh;
}

void result(shape* array, int n)													//функция вывода таблицы результата на экран
{
	int i = 0;

	puts("\n===========================================================================");		//оформление в виде таблицы
	puts("===========================================================================\n");

	printf("Тип фигуры: | Площадь фигуры: | Измерения: \n\n");

	for (i = 0; i < n; i++)															//вывод информации об i-ой фигуре
		switch ((array + i)->name)
		{
			case 1:																	//если треугольник
				printf("Треугольник | %-9.5lf см^2  | Основание: %d, высота: %d\n", (array + i)->s ,(array + i)->t.tri.b, (array + i)->t.tri.h);
				break;

			case 2:																	//если трапеция
				printf("Трапеция    | %-9.5lf см^2  | Основание 1: %d, основание 2: %d, высота: %d\n", (array + i)->s, (array + i)->t.tra.b1, (array + i)->t.tra.b2, (array + i)->t.tra.h);
				break;

			case 3:																	//если окружность
				printf("Окружность  | %-9.5lf см^2  | Радиус: %d\n", (array + i)->s, (array + i)->t.cir.r);
				break;
		}

	puts("\n===========================================================================");
	puts("===========================================================================\n");
}